package com.myapp.console;

/**
 * Інтерфейс команди або задачі.
 * Шаблони: Command, Worker Thread.
 * 
 * Завдання 1: Реалізувати можливість скасування (undo) операцій (команд).
 * Інтерфейс забезпечує базову структуру для реалізації шаблону Command,
 * який дозволяє інкапсулювати запити у вигляді об'єктів команд.
 * Це дозволяє параметризувати клієнтів з різними запитами, ставити
 * запити в чергу, зберігати історію команд та забезпечувати 
 * можливість скасування операцій (undo). Конкретні реалізації цього
 * інтерфейсу можуть зберігати початковий стан об'єктів перед
 * модифікацією для реалізації механізму скасування.
 * 
 * Завдання 2: Продемонструвати поняття "макрокоманда".
 * Цей інтерфейс є основою для створення складних команд (макрокоманд),
 * які можуть складатися з декількох простих команд та виконуватися
 * як єдине ціле. В програмі це демонструється класом CommandMenu,
 * який збирає та керує набором команд, що відповідають цьому інтерфейсу.
 * 
 * Автор: Тесленко Павло
 * Версія: 2.0
 *
 * Цей інтерфейс є основою для створення макрокоманд, які об'єднують 
 * декілька простих команд в одну складну операцію.
 * 
 * @author Тесленко Павло
 * @version 1.0
 */
public interface ICommand {
    /**
     * Виконання команди (шаблони: Command, Worker Thread).
     */
    public void execute();
}
