package com.myapp.console;

/**
 * Інтерфейс консольної команди.
 * Шаблон Command.
 * 
 * Завдання 1: Реалізувати можливість скасування (undo) операцій (команд).
 * Цей інтерфейс є розширенням базового інтерфейсу ICommand та є частиною
 * реалізації шаблону Command, що дозволяє інкапсулювати команди як об'єкти.
 * Такий підхід забезпечує можливість збереження історії команд для їх подальшого
 * скасування (undo).
 * 
 * Завдання 4: Забезпечити діалоговий інтерфейс із користувачем.
 * Метод getKey() визначає символ для взаємодії з користувачем через консоль,
 * забезпечуючи реалізацію діалогового інтерфейсу та інтуїтивний спосіб
 * введення команд.
 * 
 * Автор: Тесленко Павло
 * Версія: 1.0
 */
public interface IConsoleCommand extends ICommand {
    /**
     * Гаряча клавіша команди.
     *
     * @return символ гарячої клавіші
     */
    public char getKey();
}
