
package com.myapp.console;

/**
 * Головний клас для запуску програми.
 * 
 * Завдання 3: При розробці програми використовувати шаблон Singleton.
 * Цей клас використовує шаблон Singleton, отримуючи єдиний екземпляр
 * класу AppRunner через метод getInstance(), забезпечуючи єдину точку
 * доступу до функціональності програми.
 * 
 * Завдання 4: Забезпечити діалоговий інтерфейс із користувачем.
 * Метод main() запускає програму через AppRunner, який забезпечує
 * створення та обробку інтерактивного діалогового інтерфейсу з користувачем.
 * 
 * @author Тесленко Павло
 * @version 1.0
 */
public class Main {
    /**
     * Головний метод програми.
     * 
     * @param args аргументи командного рядка
     */
    public static void main(String[] args) {
        AppRunner.getInstance().runApp();
    }
}
