package com.myapp.console;

/**
 * Обчислення та відображення результатів.
 * Містить реалізацію статичного методу mainApp().
 * 
 * Завдання 3: При розробці програми використовувати шаблон Singleton.
 * Цей клас використовує шаблон Singleton, викликаючи єдиний екземпляр класу
 * AppRunner через метод getInstance(), забезпечуючи єдину точку доступу
 * до функціональності програми.
 * 
 * Завдання 4: Забезпечити діалоговий інтерфейс із користувачем.
 * Метод main() ініціює запуск програми через AppRunner, що забезпечує
 * інтерактивний діалоговий інтерфейс із користувачем через консоль.
 * 
 * Автор: Тесленко Павло
 * Версія: 4.0
 */
public class MainApp {
    /**
     * Головний метод, що викликається при запуску програми.
     * Викликає метод {@linkplain AppRunner#runApp()}.
     *
     * @param args параметри запуску програми
     */
    public static void main(String[] args) {
        AppRunner runner = AppRunner.getInstance();
        runner.runApp();
    }
}
