
package src;

/**
 * Інтерфейс для реалізації черги завдань.
 * 
 * Визначає базові операції для робота з чергою команд у шаблоні Worker Thread.
 * Цей інтерфейс є частиною архітектури, що забезпечує паралельну обробку даних
 * через асинхронне виконання команд.
 * 
 * @author Павло Тесленко
 * @version 1.0
 * @see Command
 * @see CommandTaskQueue
 */
public interface TaskQueue {
    /**
     * Додає нову команду до черги завдань.
     * 
     * @param command команда для виконання
     */
    void enqueue(Command command);
    
    /**
     * Виймає команду з черги завдань.
     * 
     * @return наступна команда для виконання
     */
    Command dequeue();
}
